# Лежит ли точка на бабочке

# Татаринова ИУ7-14Б

x, y = map(float, input("Введите координаты точки (x,y): ").split())
x, y = abs(x), y

eps = 1e-7

if 1<=x<=9 and (y <= (-1*(x-9)**2)/8+8 and  y >= (1*(x-1)**2)/49 and y <= 7*(x-8)**2+1) or \
   1<=x<=8 and (y <= (-4*(x-1)**2)/49 and y >= ((x-5)**2)/3-7 and y >= -2*(x-1)**2-2 and y >= -4*x**2+2)  or \
   0<=x<=1 and (y <= -4*x**2+2 and y >= 4*x**2-6) or \
   0<=x<=2 and abs(y - (1.5*x + 2) < eps):
      print ("точка лежит на бабочке")
else:
      print ("точка не лежит на бабочке")
